# ####################################################################

#  Created by Genus(TM) Synthesis Solution 18.14-s037_1 on Mon Apr 25 10:00:50 EDT 2022

# ####################################################################

set sdc_version 2.0

set_units -capacitance 1.0fF
set_units -time 1.0ps

# Set the current design
current_design mux_b_t_t_n

create_clock -name "aclk" -period 10000.0 -waveform {0.0 5000.0} [get_ports aclk]
set_clock_transition 150.0 [get_clocks aclk]
set_load -pin_load 15.0 [get_ports {out[0][3]}]
set_load -pin_load 15.0 [get_ports {out[0][2]}]
set_load -pin_load 15.0 [get_ports {out[0][1]}]
set_load -pin_load 15.0 [get_ports {out[0][0]}]
set_load -pin_load 15.0 [get_ports {out[1][3]}]
set_load -pin_load 15.0 [get_ports {out[1][2]}]
set_load -pin_load 15.0 [get_ports {out[1][1]}]
set_load -pin_load 15.0 [get_ports {out[1][0]}]
set_load -pin_load 15.0 [get_ports {out[2][3]}]
set_load -pin_load 15.0 [get_ports {out[2][2]}]
set_load -pin_load 15.0 [get_ports {out[2][1]}]
set_load -pin_load 15.0 [get_ports {out[2][0]}]
set_load -pin_load 15.0 [get_ports {out[3][3]}]
set_load -pin_load 15.0 [get_ports {out[3][2]}]
set_load -pin_load 15.0 [get_ports {out[3][1]}]
set_load -pin_load 15.0 [get_ports {out[3][0]}]
set_load -pin_load 15.0 [get_ports {out[4][3]}]
set_load -pin_load 15.0 [get_ports {out[4][2]}]
set_load -pin_load 15.0 [get_ports {out[4][1]}]
set_load -pin_load 15.0 [get_ports {out[4][0]}]
set_load -pin_load 15.0 [get_ports {out[5][3]}]
set_load -pin_load 15.0 [get_ports {out[5][2]}]
set_load -pin_load 15.0 [get_ports {out[5][1]}]
set_load -pin_load 15.0 [get_ports {out[5][0]}]
set_load -pin_load 15.0 [get_ports {out[6][3]}]
set_load -pin_load 15.0 [get_ports {out[6][2]}]
set_load -pin_load 15.0 [get_ports {out[6][1]}]
set_load -pin_load 15.0 [get_ports {out[6][0]}]
set_load -pin_load 15.0 [get_ports {out[7][3]}]
set_load -pin_load 15.0 [get_ports {out[7][2]}]
set_load -pin_load 15.0 [get_ports {out[7][1]}]
set_load -pin_load 15.0 [get_ports {out[7][0]}]
set_clock_gating_check -setup 0.0 
set_input_delay -clock [get_clocks aclk] -add_delay 2000.0 [get_ports grst]
set_input_delay -clock [get_clocks aclk] -add_delay 2000.0 [get_ports {inputs[0][3]}]
set_input_delay -clock [get_clocks aclk] -add_delay 2000.0 [get_ports {inputs[0][2]}]
set_input_delay -clock [get_clocks aclk] -add_delay 2000.0 [get_ports {inputs[0][1]}]
set_input_delay -clock [get_clocks aclk] -add_delay 2000.0 [get_ports {inputs[0][0]}]
set_input_delay -clock [get_clocks aclk] -add_delay 2000.0 [get_ports {inputs[1][3]}]
set_input_delay -clock [get_clocks aclk] -add_delay 2000.0 [get_ports {inputs[1][2]}]
set_input_delay -clock [get_clocks aclk] -add_delay 2000.0 [get_ports {inputs[1][1]}]
set_input_delay -clock [get_clocks aclk] -add_delay 2000.0 [get_ports {inputs[1][0]}]
set_input_delay -clock [get_clocks aclk] -add_delay 2000.0 [get_ports {inputs[2][3]}]
set_input_delay -clock [get_clocks aclk] -add_delay 2000.0 [get_ports {inputs[2][2]}]
set_input_delay -clock [get_clocks aclk] -add_delay 2000.0 [get_ports {inputs[2][1]}]
set_input_delay -clock [get_clocks aclk] -add_delay 2000.0 [get_ports {inputs[2][0]}]
set_input_delay -clock [get_clocks aclk] -add_delay 2000.0 [get_ports {inputs[3][3]}]
set_input_delay -clock [get_clocks aclk] -add_delay 2000.0 [get_ports {inputs[3][2]}]
set_input_delay -clock [get_clocks aclk] -add_delay 2000.0 [get_ports {inputs[3][1]}]
set_input_delay -clock [get_clocks aclk] -add_delay 2000.0 [get_ports {inputs[3][0]}]
set_input_delay -clock [get_clocks aclk] -add_delay 2000.0 [get_ports {inputs[4][3]}]
set_input_delay -clock [get_clocks aclk] -add_delay 2000.0 [get_ports {inputs[4][2]}]
set_input_delay -clock [get_clocks aclk] -add_delay 2000.0 [get_ports {inputs[4][1]}]
set_input_delay -clock [get_clocks aclk] -add_delay 2000.0 [get_ports {inputs[4][0]}]
set_input_delay -clock [get_clocks aclk] -add_delay 2000.0 [get_ports {inputs[5][3]}]
set_input_delay -clock [get_clocks aclk] -add_delay 2000.0 [get_ports {inputs[5][2]}]
set_input_delay -clock [get_clocks aclk] -add_delay 2000.0 [get_ports {inputs[5][1]}]
set_input_delay -clock [get_clocks aclk] -add_delay 2000.0 [get_ports {inputs[5][0]}]
set_input_delay -clock [get_clocks aclk] -add_delay 2000.0 [get_ports {inputs[6][3]}]
set_input_delay -clock [get_clocks aclk] -add_delay 2000.0 [get_ports {inputs[6][2]}]
set_input_delay -clock [get_clocks aclk] -add_delay 2000.0 [get_ports {inputs[6][1]}]
set_input_delay -clock [get_clocks aclk] -add_delay 2000.0 [get_ports {inputs[6][0]}]
set_input_delay -clock [get_clocks aclk] -add_delay 2000.0 [get_ports {inputs[7][3]}]
set_input_delay -clock [get_clocks aclk] -add_delay 2000.0 [get_ports {inputs[7][2]}]
set_input_delay -clock [get_clocks aclk] -add_delay 2000.0 [get_ports {inputs[7][1]}]
set_input_delay -clock [get_clocks aclk] -add_delay 2000.0 [get_ports {inputs[7][0]}]
set_input_delay -clock [get_clocks aclk] -add_delay 2000.0 [get_ports select]
set_output_delay -clock [get_clocks aclk] -add_delay 2000.0 [get_ports {out[0][3]}]
set_output_delay -clock [get_clocks aclk] -add_delay 2000.0 [get_ports {out[0][2]}]
set_output_delay -clock [get_clocks aclk] -add_delay 2000.0 [get_ports {out[0][1]}]
set_output_delay -clock [get_clocks aclk] -add_delay 2000.0 [get_ports {out[0][0]}]
set_output_delay -clock [get_clocks aclk] -add_delay 2000.0 [get_ports {out[1][3]}]
set_output_delay -clock [get_clocks aclk] -add_delay 2000.0 [get_ports {out[1][2]}]
set_output_delay -clock [get_clocks aclk] -add_delay 2000.0 [get_ports {out[1][1]}]
set_output_delay -clock [get_clocks aclk] -add_delay 2000.0 [get_ports {out[1][0]}]
set_output_delay -clock [get_clocks aclk] -add_delay 2000.0 [get_ports {out[2][3]}]
set_output_delay -clock [get_clocks aclk] -add_delay 2000.0 [get_ports {out[2][2]}]
set_output_delay -clock [get_clocks aclk] -add_delay 2000.0 [get_ports {out[2][1]}]
set_output_delay -clock [get_clocks aclk] -add_delay 2000.0 [get_ports {out[2][0]}]
set_output_delay -clock [get_clocks aclk] -add_delay 2000.0 [get_ports {out[3][3]}]
set_output_delay -clock [get_clocks aclk] -add_delay 2000.0 [get_ports {out[3][2]}]
set_output_delay -clock [get_clocks aclk] -add_delay 2000.0 [get_ports {out[3][1]}]
set_output_delay -clock [get_clocks aclk] -add_delay 2000.0 [get_ports {out[3][0]}]
set_output_delay -clock [get_clocks aclk] -add_delay 2000.0 [get_ports {out[4][3]}]
set_output_delay -clock [get_clocks aclk] -add_delay 2000.0 [get_ports {out[4][2]}]
set_output_delay -clock [get_clocks aclk] -add_delay 2000.0 [get_ports {out[4][1]}]
set_output_delay -clock [get_clocks aclk] -add_delay 2000.0 [get_ports {out[4][0]}]
set_output_delay -clock [get_clocks aclk] -add_delay 2000.0 [get_ports {out[5][3]}]
set_output_delay -clock [get_clocks aclk] -add_delay 2000.0 [get_ports {out[5][2]}]
set_output_delay -clock [get_clocks aclk] -add_delay 2000.0 [get_ports {out[5][1]}]
set_output_delay -clock [get_clocks aclk] -add_delay 2000.0 [get_ports {out[5][0]}]
set_output_delay -clock [get_clocks aclk] -add_delay 2000.0 [get_ports {out[6][3]}]
set_output_delay -clock [get_clocks aclk] -add_delay 2000.0 [get_ports {out[6][2]}]
set_output_delay -clock [get_clocks aclk] -add_delay 2000.0 [get_ports {out[6][1]}]
set_output_delay -clock [get_clocks aclk] -add_delay 2000.0 [get_ports {out[6][0]}]
set_output_delay -clock [get_clocks aclk] -add_delay 2000.0 [get_ports {out[7][3]}]
set_output_delay -clock [get_clocks aclk] -add_delay 2000.0 [get_ports {out[7][2]}]
set_output_delay -clock [get_clocks aclk] -add_delay 2000.0 [get_ports {out[7][1]}]
set_output_delay -clock [get_clocks aclk] -add_delay 2000.0 [get_ports {out[7][0]}]
set_clock_uncertainty -setup 400.0 [get_clocks aclk]
set_clock_uncertainty -hold 400.0 [get_clocks aclk]
